const a0_0xf1824 = a0_0x1acd;
(function (_0x5f47bb, _0x40fdb4) {
  const _0x15f91e = a0_0x1acd,
    _0x8e6a89 = _0x5f47bb();
  while (!![]) {
    try {
      const _0x410f5d =
        (-parseInt(_0x15f91e(0x19a)) / 0x1) *
          (-parseInt(_0x15f91e(0x1a8)) / 0x2) +
        (parseInt(_0x15f91e(0x1b8)) / 0x3) *
          (parseInt(_0x15f91e(0x1c5)) / 0x4) +
        (parseInt(_0x15f91e(0x1c3)) / 0x5) *
          (-parseInt(_0x15f91e(0x1a0)) / 0x6) +
        parseInt(_0x15f91e(0x192)) / 0x7 +
        (-parseInt(_0x15f91e(0x198)) / 0x8) *
          (parseInt(_0x15f91e(0x19e)) / 0x9) +
        (-parseInt(_0x15f91e(0x18f)) / 0xa) *
          (parseInt(_0x15f91e(0x196)) / 0xb) +
        (parseInt(_0x15f91e(0x19c)) / 0xc) * (parseInt(_0x15f91e(0x1c1)) / 0xd);
      if (_0x410f5d === _0x40fdb4) break;
      else _0x8e6a89["push"](_0x8e6a89["shift"]());
    } catch (_0x557924) {
      _0x8e6a89["push"](_0x8e6a89["shift"]());
    }
  }
})(a0_0x3e3e, 0x88c14);
function a0_0x1acd(_0x498bf8, _0x48df26) {
  const _0x3e3ed4 = a0_0x3e3e();
  return (
    (a0_0x1acd = function (_0x1acd94, _0x2bfa30) {
      _0x1acd94 = _0x1acd94 - 0x18e;
      let _0x17eb2b = _0x3e3ed4[_0x1acd94];
      return _0x17eb2b;
    }),
    a0_0x1acd(_0x498bf8, _0x48df26)
  );
}
export const teluguWords = {
  ప్రదేశాలు: {
    word1: a0_0xf1824(0x1c9),
    word2: a0_0xf1824(0x1a9),
    word3: a0_0xf1824(0x1b5),
    word4: a0_0xf1824(0x1b4),
    word5: "భారతదేశం",
    word6: "హైదరాబాద్",
    word7: a0_0xf1824(0x1b6),
    word8: a0_0xf1824(0x1b7),
    word9: "నెల్లూరు",
    word10: a0_0xf1824(0x1be),
    word11: a0_0xf1824(0x19d),
  },
  సినిమాలు: {
    word1: "నాగభైరవి",
    word2: a0_0xf1824(0x1bb),
    word3: a0_0xf1824(0x1ab),
    word4: a0_0xf1824(0x1af),
    word5: a0_0xf1824(0x1ba),
    word6: a0_0xf1824(0x1a2),
    word7: "బాహుబలి",
    word8: a0_0xf1824(0x193),
    word9: a0_0xf1824(0x194),
    word10: "ఇంద్రసేనా",
    word11: a0_0xf1824(0x1b0),
    word12: a0_0xf1824(0x1b9),
  },
  సాహిత్యం: {
    word1: a0_0xf1824(0x1ac),
    word2: a0_0xf1824(0x1a4),
    word3: a0_0xf1824(0x1bd),
    word4: a0_0xf1824(0x1aa),
    word5: "అగ్నిపూలు",
    word6: "మహాభారతం",
    word7: a0_0xf1824(0x1a5),
    word8: a0_0xf1824(0x19b),
    word9: a0_0xf1824(0x1ad),
    word10: a0_0xf1824(0x1c0),
    word11: "కలిభారతం",
  },
  వస్తువులు: {
    word1: a0_0xf1824(0x1c4),
    word2: a0_0xf1824(0x1bf),
    word3: a0_0xf1824(0x199),
    word4: a0_0xf1824(0x18e),
    word5: "నిఘంటువు",
    word6: a0_0xf1824(0x1b2),
  },
};
export const keyValuePairs = {
  ప్రదేశాలు: {
    word1: { బ: "బె", జ: "జ", వ: "వా", డ: "డ" },
    word2: { వ: "వ", ర: "రం", గ: "గ", ల: "ల్" },
    word3: {
      శ: a0_0xf1824(0x1c2),
      క: "కా",
      ళ: "ళ",
      హ: "హ",
      స: a0_0xf1824(0x1b1),
    },
    word4: { చ: "చి", ర: "ర", ప: a0_0xf1824(0x1bc), జ: "జి" },
    word5: { భ: "భా", ర: "ర", త: "త", ద: "దే", శ: "శం" },
    word6: { హ: "హై", ద: ["ద", "ద్"], ర: "రా", బ: "బా" },
    word7: { త: ["తి", "తి"], ర: "రు", ప: "ప" },
    word8: { వ: "వి", శ: "శా", ఖ: "ఖ", ప: "ప", ట: a0_0xf1824(0x191) },
    word9: { న: "నె", ల: a0_0xf1824(0x1a7), ర: "రు" },
    word10: { క: ["కా", "కి"], న: "నా", డ: "డ" },
    word11: { చ: "చి", త: a0_0xf1824(0x1a1), ర: "రు" },
  },
  సినిమాలు: {
    word1: { న: "నా", గ: "గ", భ: "భై", ర: "ర", వ: "వి" },
    word2: { స: a0_0xf1824(0x1a3), య: "యం", క: "కృ", ష: "షి" },
    word3: { స: "సం", క: a0_0xf1824(0x190), త: "తి" },
    word4: { మ: "మా", య: "యా", బ: "బ", జ: "జా", ర: "ర్" },
    word5: { బ: "బా", ల: "ల", క: "కృ", ష: a0_0xf1824(0x195) },
    word6: { వ: a0_0xf1824(0x1c7), క: "క", ట: "టే", ష: "ష్" },
    word7: { బ: ["బా", "బ"], హ: "హు", ల: "లి" },
    word8: { శ: "శం", క: "క", ర: "ర్", ద: ["దా", "దా"] },
    word9: { మ: "మ", గ: "గ", ధ: "ధీ", ర: "ర" },
    word10: { ఇ: "ఇం", ద: a0_0xf1824(0x19f), స: "సే", న: "నా" },
    word11: { ర: "రు", ద: [a0_0xf1824(0x19f), "దే"], మ: "మ", వ: "వి" },
    word12: { అ: "అ", ర: [a0_0xf1824(0x1c6), "రె"], న: "న్", డ: "డ్డి" },
  },
  సాహిత్యం: {
    word1: { స: "సా", హ: "హి", త: "త్యం" },
    word2: { క: "క", వ: "వి", త: "త" },
    word3: { న: "న", వ: "వ", ల: "ల" },
    word4: { అ: "అ", డ: "డ", వ: "వి", బ: "బా", ప: "పి", ర: "రా", జ: "జు" },
    word5: { అ: "అ", గ: "గ్ని", ప: "పూ", ల: "లు" },
    word6: { మ: "మ", హ: "హా", భ: "భా", ర: "ర", త: "తం" },
    word7: { ర: "రా", మ: "మా", య: "య", ణ: "ణం" },
    word8: { వ: "వే", మ: "మ", న: "న", ప: "ప", ద: a0_0xf1824(0x1ae), ల: "లు" },
    word9: { ఆ: "ఆం", ధ: a0_0xf1824(0x197), క: "క", వ: "వి", త: "త" },
    word10: {
      త: ["తె", a0_0xf1824(0x1a6)],
      ల: "లు",
      గ: "గు",
      స: "సా",
      హ: "హి",
    },
    word11: { క: "క", ల: "లి", భ: "భా", ర: "ర", త: "తం" },
  },
  వస్తువులు: {
    word1: { గ: "గ", డ: "డి", య: "యా", ర: "రం" },
    word2: { క: "క", ల: "ల", ప: "ప" },
    word3: { ప: "పు", స: a0_0xf1824(0x1b3), క: "కం" },
    word4: { అ: "అం", త: "త", ర: a0_0xf1824(0x1c8), ల: "లం" },
    word5: { న: "ని", ఘ: "ఘం", ట: "టు", వ: "వు" },
    word6: { క: ["క", "కం"], న: "న" },
  },
};
function a0_0x3e3e() {
  const _0x352e27 = [
    "ల్లూ",
    "16186QGutNe",
    "వరంగల్",
    "అడవిబాపిరాజు",
    "సంక్రాంతి",
    "సాహిత్యం",
    "ఆంధ్రకవిత",
    "ద్యా",
    "మాయాబజార్",
    "రుద్రమదేవి",
    "స్తి",
    "కనకం",
    "స్త",
    "చిరపుంజి",
    "శ్రీకాళహస్తి",
    "తిరుపతి",
    "విశాఖపట్నం",
    "943023SqJWUk",
    "అర్జున్\x20రెడ్డి",
    "బాలకృష్ణ",
    "స్వయంకృషి",
    "పుం",
    "నవల",
    "కాకినాడ",
    "కలప",
    "తెలుగుసాహిత్యం",
    "26714675koOUqM",
    "శ్రీ",
    "2339845yIQbdQ",
    "గడియారం",
    "4pNVGqk",
    "ర్జు",
    "వెం",
    "ర్జా",
    "బెజవాడ",
    "అంతర్జాలం",
    "11059260zYdYpZ",
    "క్రాం",
    "ట్నం",
    "2980369qZZotZ",
    "శంకర్‌దాదా",
    "మగధీర",
    "ష్ణ",
    "11fBriXf",
    "ధ్ర",
    "2528AvWRWV",
    "పుస్తకం",
    "113xNPGeN",
    "వేమనపద్యాలు",
    "12exkeJv",
    "చిత్తూరు",
    "31545LMASPN",
    "ద్ర",
    "12awiTZT",
    "త్తూ",
    "వెంకటేష్",
    "స్వ",
    "కవిత",
    "రామాయణం",
    "త్యం",
  ];
  a0_0x3e3e = function () {
    return _0x352e27;
  };
  return a0_0x3e3e();
}
