// data.js

export const teluguWords = {
  ప్రదేశాలు: {
    word1: "బెజవాడ",
    word2: "వరంగల్",
    word3: "శ్రీకాళహస్తి",
  },
  సినిమాలు: {
    word1: "నాగభైరవి",
    word2: "స్వయంకృషి",
    word3: "సంక్రాంతి",
  },
  సాహిత్యం: {
    word1: "సాహిత్యం",
    word2: "కవిత",
    word3: "నవల",
  },
  వస్తువులు: {
    word1: "గడియారం",
    word2: "కలప",
    word3: "పుస్తకం",
  },
};

export const keyValuePairs = {
  ప్రదేశాలు: {
    word1: { బ: "బె", జ: "జ", వ: "వా", డ: "డ" },
    word2: { వ: "వ", ర: "రం", గ: "గ", ల: "ల్" },
    word3: { శ: "శ్రీ", క: "కా", ళ: "ళ", హ: "హ", స: "స్తి" },
  },

  సినిమాలు: {
    word1: { న: "నా", గ: "గ", భ: "భై", ర: "ర", వ: "వి" },
    word2: { స: "స్వ", య: "యం", క: "కృ", ష: "షి" },
    word3: { స: "సం", క: "క్రాం", త: "తి" },
  },
  సాహిత్యం: {
    word1: { స: "సా", హ: "హి", త: "త్యం" },
    word2: { క: "క", వ: "వి", త: "త" },
    word3: { న: "న", వ: "వ", ల: "ల" },
  },
  వస్తువులు: {
    word1: { గ: "గ", డ: "డి", య: "యా", ర: "రం" },
    word2: { క: "క", ల: "ల", ప: "ప" },
    word3: { ప: "పు", స: "స్త", క: "కం" },
  },
};
