// data.js

export const teluguWords = {
  ప్రదేశాలు: {
    word1: "బెజవాడ",
    word2: "వరంగల్",
    word3: "శ్రీకాళహస్తి",
    word4: "చిరపుంజి",
    word5: "భారతదేశం",
  },
  సినిమాలు: {
    word1: "నాగభైరవి",
    word2: "స్వయంకృషి",
    word3: "సంక్రాంతి",
    word4: "మాయాబజార్",
    word5: "బాలకృష్ణ",
    word6: "వెంకటేష్",
  },
  సాహిత్యం: {
    word1: "సాహిత్యం",
    word2: "కవిత",
    word3: "నవల",
    word4: "అడవిబాపిరాజు",
    word5: "అగ్నిపూలు",
  },
  వస్తువులు: {
    word1: "గడియారం",
    word2: "కలప",
    word3: "పుస్తకం",
    word4: "అంతర్జాలం",
    word5: "నిఘంటువు",
    word6: "కనకం",
  },
};

export const keyValuePairs = {
  ప్రదేశాలు: {
    word1: { బ: "బె", జ: "జ", వ: "వా", డ: "డ" },
    word2: { వ: "వ", ర: "రం", గ: "గ", ల: "ల్" },
    word3: { శ: "శ్రీ", క: "కా", ళ: "ళ", హ: "హ", స: "స్తి" },
    word4: { చ: "చి", ర: "ర", ప: "పుం", జ: "జి" },
    word5: { భ: "భా", ర: "ర", త: "త", ద: "దే", శ: "శం" },
  },

  సినిమాలు: {
    word1: { న: "నా", గ: "గ", భ: "భై", ర: "ర", వ: "వి" },
    word2: { స: "స్వ", య: "యం", క: "కృ", ష: "షి" },
    word3: { స: "సం", క: "క్రాం", త: "తి" },
    word4: { మ: "మా", య: "యా", బ: "బ", జ: "జా", ర: "ర్" },
    word5: { బ: "బా", ల: "ల", క: "కృ", ష: "ష్ణ" },
    word6: { వ: "వెం", క: "క", ట: "టే", ష: "ష్" },
  },

  సాహిత్యం: {
    word1: { స: "సా", హ: "హి", త: "త్యం" },
    word2: { క: "క", వ: "వి", త: "త" },
    word3: { న: "న", వ: "వ", ల: "ల" },
    word4: { అ: "అ", డ: "డ", వ: "వి", బ: "బా", ప: "పి", ర: "రా", జ: "జు" },
    word5: { అ: "అ", గ: "గ్ని", ప: "పూ", ల: "లు" },
  },

  వస్తువులు: {
    word1: { గ: "గ", డ: "డి", య: "యా", ర: "రం" },
    word2: { క: "క", ల: "ల", ప: "ప" },
    word3: { ప: "పు", స: "స్త", క: "కం" },
    word4: { అ: "అం", త: "త", ర: "ర్జా", ల: "లం" },
    word5: { న: "ని", ఘ: "ఘం", ట: "టు", వ: "వు" },
    word6: { క: ["క", "కం"], న: "న" },
  },
};
